plantalog/cadi-gcl/stm32f407/current/wireless_nrf24/nrf24_lib.c
// #include "stm32f4xx_conf.h"
#include "nrf24_lib.h"

uint8_t aTxBuffer[NRF24_DMA_BUFFERSIZE] = "SPI Master/Slave : Communication between two SPI using Interrupts";
__IO uint8_t aRxBuffer [NRF24_DMA_BUFFERSIZE];
__IO uint8_t ubRxIndex = 0;
__IO uint8_t ubTxIndex = 0;
__IO uint32_t TimeOut = 0;

unsigned char nrfRxBuff[NRF24_RX_BUFF_SIZE];
unsigned char nrfTxBuff[NRF24_TX_BUFF_SIZE];
uint8_t nrf_rx_pointer=0, nrf_tx_pointer=0;

// copy-paste from ST.com example with Interrupts

void nrf24init(void){
	  GPIO_InitTypeDef GPIO_InitStructure;
	  NVIC_InitTypeDef NVIC_InitStructure;
	  SPI_InitTypeDef  SPI_InitStructure;

	  /* Peripheral Clock Enable -------------------------------------------------*/
	  /* Enable the SPI clock */
	  NRF24_SPIx_CLK_INIT(NRF24_SPIx_CLK, ENABLE);

	  /* Enable GPIO clocks */
	  RCC_AHB1PeriphClockCmd(NRF24_SPIx_SCK_GPIO_CLK | NRF24_SPIx_MISO_GPIO_CLK | NRF24_SPIx_MOSI_GPIO_CLK, ENABLE);

	  RCC_AHB1PeriphClockCmd(NRF24_CEN_GPIO_CLK, ENABLE);               

	  /* Configure the NRF interrupt pin */
	  GPIO_InitStructure.GPIO_Pin = NRF24_IRQ_PIN;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;	// GPIO_Mode_AF ??
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;             
	  GPIO_Init(NRF24_IRQ_PORT, &GPIO_InitStructure);
	  
	  /* Configure the  NRF Chip Enable (pin 3) pin */
	  GPIO_InitStructure.GPIO_Pin = NRF24_CEN_PIN;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                
	  GPIO_Init(NRF24_CEN_PORT, &GPIO_InitStructure);
	  
	  /* Configure NRF Chip Select (pin 4) pin */
	  GPIO_InitStructure.GPIO_Pin = NRF24_CSN_PIN;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                
	  GPIO_Init(NRF24_CSN_PORT, &GPIO_InitStructure);
	  
	  /* SPI GPIO Configuration --------------------------------------------------*/
	  /* GPIO Deinitialisation */
	  GPIO_DeInit(NRF24_SPIx_SCK_GPIO_PORT);
	  GPIO_DeInit(NRF24_SPIx_MISO_GPIO_PORT);
	  GPIO_DeInit(NRF24_SPIx_MOSI_GPIO_PORT);

	  // Connect SPI pins to AF5 (CHECK IF NEEDED)
	  GPIO_PinAFConfig(NRF24_SPIx_SCK_GPIO_PORT, NRF24_SPIx_SCK_SOURCE, NRF24_SPIx_SCK_AF);
	  GPIO_PinAFConfig(NRF24_SPIx_MISO_GPIO_PORT, NRF24_SPIx_MISO_SOURCE, NRF24_SPIx_MISO_AF);
	  GPIO_PinAFConfig(NRF24_SPIx_MOSI_GPIO_PORT, NRF24_SPIx_MOSI_SOURCE, NRF24_SPIx_MOSI_AF);

	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_DOWN;

	  /* SPI SCK pin configuration */
	  GPIO_InitStructure.GPIO_Pin = NRF24_SPIx_SCK_PIN;
	  GPIO_Init(NRF24_SPIx_SCK_GPIO_PORT, &GPIO_InitStructure);

	  /* SPI  MISO pin configuration */
	  GPIO_InitStructure.GPIO_Pin =  NRF24_SPIx_MISO_PIN;
	  GPIO_Init(NRF24_SPIx_MISO_GPIO_PORT, &GPIO_InitStructure);

	  /* SPI  MOSI pin configuration */
	  GPIO_InitStructure.GPIO_Pin =  NRF24_SPIx_MOSI_PIN;
	  GPIO_Init(NRF24_SPIx_MOSI_GPIO_PORT, &GPIO_InitStructure);
	  

	  /* SPI configuration -------------------------------------------------------*/
	  SPI_I2S_DeInit(NRF24_SPIx);
	  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft | SPI_NSSInternalSoft_Set;
	  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
	  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	  SPI_InitStructure.SPI_CRCPolynomial = 7;
	  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
//	  NRF24_CEN_LOW;
//	  NRF24_CSN_LOW;
	  SPI_Init(NRF24_SPIx, &SPI_InitStructure);
	  	//  SPI1->CR2 |= SPI_CR2_SSOE;	
	  	  
	  	  SPI1->CR1    |= SPI_CR1_SSI;       // nss HIGH
	  	  SPI1->CR1    |= SPI_CR1_SSM;       // enable soft nss
	  NRF24_SPIx->CR2 |= (uint16_t)SPI_CR2_SSOE; // set nss pin as output
	  SPI1->CR2 |= SPI_CR2_SSOE;	
//	  NRF24_SPIx->CR1 |= SPI_NSSInternalSoft_Set;
	  
	  /* Configure the Priority Group to 1 bit */
	  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	  /* Configure the SPI interrupt priority */
	  NVIC_InitStructure.NVIC_IRQChannel = NRF24_SPIx_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);
	  
	  SPI_Cmd(NRF24_SPIx, ENABLE);
	  
	  /* Initialize Buffer counters */
	  ubTxIndex = 0;
	  ubRxIndex = 0;
	  
	  /* Enable the Rx buffer not empty interrupt */
	  SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_RXNE, ENABLE);
	  
	  /* Enable the Tx buffer empty interrupt */
	  SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_TXE, ENABLE);
	  // set CSN to HIGH
	  NRF24_CSN_HIGH;
 }

// copy-paste from ST.com examples with DMA
void nrf24init_dma(void){
	GPIO_InitTypeDef GPIO_InitStructure;
	  DMA_InitTypeDef DMA_InitStructure;

	  SPI_InitTypeDef  SPI_InitStructure;

	  /* Peripheral Clock Enable -------------------------------------------------*/
	  /* Enable the SPI clock */
	  SPIx_CLK_INIT(NRF24_SPIx_CLK, ENABLE);

	  /* Enable GPIO clocks */
	  RCC_AHB1PeriphClockCmd(NRF24_SPIx_SCK_GPIO_CLK | NRF24_SPIx_MISO_GPIO_CLK | NRF24_SPIx_MOSI_GPIO_CLK, ENABLE);

	  /* Enable DMA clock */
	  RCC_AHB1PeriphClockCmd(NRF24_SPIx_DMA_CLK, ENABLE);

	  /* SPI GPIO Configuration --------------------------------------------------*/
	  /* GPIO Deinitialisation */
	  GPIO_DeInit(NRF24_SPIx_SCK_GPIO_PORT);
	  GPIO_DeInit(NRF24_SPIx_MISO_GPIO_PORT);
	  GPIO_DeInit(NRF24_SPIx_MOSI_GPIO_PORT);

	  /* Connect SPI pins to AF5 */
	  GPIO_PinAFConfig(NRF24_SPIx_SCK_GPIO_PORT, NRF24_SPIx_SCK_SOURCE, NRF24_SPIx_SCK_AF);
	  GPIO_PinAFConfig(NRF24_SPIx_MISO_GPIO_PORT, NRF24_SPIx_MISO_SOURCE, NRF24_SPIx_MISO_AF);
	  GPIO_PinAFConfig(NRF24_SPIx_MOSI_GPIO_PORT, NRF24_SPIx_MOSI_SOURCE, NRF24_SPIx_MOSI_AF);

	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_DOWN;

	  /* SPI SCK pin configuration */
	  GPIO_InitStructure.GPIO_Pin = NRF24_SPIx_SCK_PIN;
	  GPIO_Init(NRF24_SPIx_SCK_GPIO_PORT, &GPIO_InitStructure);

