plantalog/cadi-gcl/stm32f407/current/wireless_nrf24/nrf24_lib.c
	  /* SPI  MISO pin configuration */
	  GPIO_InitStructure.GPIO_Pin =  NRF24_SPIx_MISO_PIN;
	  GPIO_Init(NRF24_SPIx_MISO_GPIO_PORT, &GPIO_InitStructure);

	  /* SPI  MOSI pin configuration */
	  GPIO_InitStructure.GPIO_Pin =  NRF24_SPIx_MOSI_PIN;
	  GPIO_Init(NRF24_SPIx_MOSI_GPIO_PORT, &GPIO_InitStructure);

	  /* SPI configuration -------------------------------------------------------*/
	  SPI_I2S_DeInit(NRF24_SPIx);
	  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
	  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	  SPI_InitStructure.SPI_CRCPolynomial = 7;
	  // master setting?
	  NRF24_SPIx->CR2 |= (uint16_t)SPI_CR2_SSOE; // set nss pin as output
	  SPI1->CR2 |= SPI_CR2_SSOE;	
	  NRF24_SPIx->CR1 |= SPI_NSSInternalSoft_Set;
	  /* DMA configuration -------------------------------------------------------*/
	  /* Deinitialize DMA Streams */
	  DMA_DeInit(NRF24_SPIx_TX_DMA_STREAM);
	  DMA_DeInit(NRF24_SPIx_RX_DMA_STREAM);

	  

	  /* Configure DMA Initialization Structure */
	  DMA_InitStructure.DMA_BufferSize = NRF24_DMA_BUFFERSIZE;
	  DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
	  DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
	  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	  DMA_InitStructure.DMA_PeripheralBaseAddr =(uint32_t) (&(NRF24_SPIx->DR));
	  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	  DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	  /* Configure TX DMA */
	  DMA_InitStructure.DMA_Channel = NRF24_SPIx_TX_DMA_CHANNEL;
	  DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	  DMA_InitStructure.DMA_Memory0BaseAddr =(uint32_t)aTxBuffer;
	  DMA_Init(NRF24_SPIx_TX_DMA_STREAM, &DMA_InitStructure);
	  /* Configure RX DMA */
	  DMA_InitStructure.DMA_Channel = NRF24_SPIx_RX_DMA_CHANNEL;
	  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
	  DMA_InitStructure.DMA_Memory0BaseAddr =(uint32_t)aRxBuffer;
	  DMA_Init(NRF24_SPIx_RX_DMA_STREAM, &DMA_InitStructure);

}


// copy-paste from SPI sd card init
static void nrf24init2(void)
{
/*	SPI_InitTypeDef  SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	// Enable SPI & GPIO clocks 
	SPI_GPIO_CLK(ENABLE);
	SPI_PERIF_CLK(ENABLE);

#ifdef USE_PWRCTRL
	// Configure I/O for Power FET 
	SPIMMC_PWR_CLK(ENABLE);

	GPIO_InitStructure.GPIO_Pin		= SPIMMC_PIN_PWR;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType 	= GPIO_OType_OD; // pull-up resistor at power FET
	GPIO_InitStructure.GPIO_PuPd 	= GPIO_PuPd_NOPULL;
	GPIO_Init(GPIO_PWR, &GPIO_InitStructure);
	PWR_ON();
#endif

	//for (Timer1 = 25; Timer1; );	// Wait for 250ms
	Delay_mS(250);

	// Configure I/O for Flash Chip select 
	GPIO_InitStructure.GPIO_Pin		= SPIMMC_PIN_CS;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType 	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd 	= GPIO_PuPd_NOPULL;
	GPIO_Init(SPIMMC_PORT_CS, &GPIO_InitStructure);

	// Deselect the Card: Chip Select high 
	CS_HIGH();


	// Connect SPI pins to AF 
	SPI_AF_SET();
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;

	// SPI SCK pin configuration
	GPIO_InitStructure.GPIO_Pin = SPIMMC_PIN_SCK;
	GPIO_Init(SPIMMC_PORT_SCK, &GPIO_InitStructure);

	// SPI MOSI pin configuration
	GPIO_InitStructure.GPIO_Pin =  SPIMMC_PIN_MOSI;
	GPIO_Init(SPIMMC_PORT_MOSI, &GPIO_InitStructure);

	// SPI MISO pin configuration
	GPIO_InitStructure.GPIO_Pin =  SPIMMC_PIN_MISO;
	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_DOWN;
	GPIO_Init(SPIMMC_PORT_MISO, &GPIO_InitStructure);


	// SPI_MMC configuration
	SPI_InitStructure.SPI_Direction	 		= SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode		 		= SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize	 		= SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL		 		= SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA		 		= SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS		 		= SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // 84000kHz /256 = 328 < 400kHz
	SPI_InitStructure.SPI_FirstBit	 		= SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial 	= 7;
	SPI_Init(SPIMMC, &SPI_InitStructure);


	SPI_CalculateCRC(SPIMMC, DISABLE);

	// Enable SPIx 
	//SPIMMC->CR1 |= SPI_CR1_SPE;
	SPI_Cmd(SPIMMC, ENABLE);

	// drain SPI
	//while (!(SPIMMC->SR & SPI_I2S_FLAG_TXE)) { ; }
	while(SPI_I2S_GetFlagStatus(SPIMMC, SPI_I2S_FLAG_TXE) == RESET);
	SPIMMC->DR;

#ifdef USE_SPIMMC_DMA
	// Enable DMA clock
	RCC_AHB1PeriphClockCmd(SPIMMC_DMA_STREAM_CLOCK, ENABLE);

 	// Disable SPI_DMA_TX/RX
    SPIMMC_DMA_STREAM_RX->CR &= ~(uint32_t)DMA_SxCR_EN;
    SPIMMC_DMA_STREAM_TX->CR &= ~(uint32_t)DMA_SxCR_EN;
	DMA_DeInit(SPIMMC_DMA_STREAM_RX);
	DMA_DeInit(SPIMMC_DMA_STREAM_TX);

	// shared DMA configuration values
	DMA_InitStructure.DMA_Channel 				= SPIMMC_DMA_CHANNEL_RX;
	DMA_InitStructure.DMA_PeripheralBaseAddr 	= (uint32_t)(&(SPIMMC->DR));
	DMA_InitStructure.DMA_PeripheralInc 		= DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_PeripheralDataSize 	= DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize 		= DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode 					= DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority 				= DMA_Priority_High;
	DMA_InitStructure.DMA_FIFOMode 				= DMA_FIFOMode_Disable;
	DMA_InitStructure.DMA_FIFOThreshold 		= DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst 			= DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst 		= DMA_PeripheralBurst_Single;

#endif

*/
}

// https://github.com/wendlers/libemb/blob/master/libnrf24l01/src/nrf24l01.c
/*
* This file is part of the libemb project.
*
* Copyright (C) 2011 Stefan Wendler <sw@kaltpost.de>
*
* This program is free software: you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation, either version 3 of the License, or
* (at your option) any later version.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with this program. If not, see <http://www.gnu.org/licenses/>.
*/


