plantalog/cadi-gcl/stm32f407/current/wireless_nrf24/nrf24_lib.c
/*
int nrf_read_reg(unsigned char reg, nrf_reg_buf *buf)
{
     int i;

     // get register payload size
     unsigned char s = nrf_reg_def.data[reg].size;

     nrf_spi_csl();

     // send command
     nrf_spi_xfer_byte(NRF_CMD_RREG | reg);

     // receive response
     for(i = 0; i < s; i++) {
          buf->data[i] = nrf_spi_xfer_byte(NRF_CMD_NOP);
     }

     nrf_spi_csh();

     buf->size = i;

     return i;
}



int nrf_write_reg(unsigned char reg, nrf_reg_buf *buf)
{
     int i;

     // get register payload size
     unsigned char s = nrf_reg_def.data[reg].size;

     NRF24_CSN_LOW;

     // send command
     nrf_spi_xfer_byte(NRF_CMD_WREG | reg);

     // send payload
     for(i = 0; i < s; i++) {
          nrf_spi_xfer_byte(buf->data[i]);
     }

     NRF24_CSN_HIGH;

     return i;
}



int nrf_send(nrf_payload *payload)
{
     int i;

     nrf_reg_buf status;
     nrf_read_reg(NRF_REG_STATUS, &status);

     // if TX buffer is full, indicate no bytes where sent, flush TX buffer
     if(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_TX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_TX);
          nrf_spi_csh();
          return NRF_ERR_TX_FULL;
     }

     // send command
     nrf_spi_csl();
     nrf_spi_xfer_byte(NRF_CMD_TX);

     // send payload
     for(i = 0; i < payload->size; i++) {
          nrf_spi_xfer_byte(payload->data[i]);
     }

     nrf_spi_csh();

     return i;
}

int nrf_send_blocking(nrf_payload *payload)
{
     int i;

     nrf_reg_buf status;
     nrf_read_reg(NRF_REG_STATUS, &status);

     // if TX buffer is full, indicate no bytes where sent, flush TX buffer
     if(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_TX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_TX);
          nrf_spi_csh();
          i = NRF_ERR_TX_FULL;
     }

     // send command
     nrf_spi_csl();
     nrf_spi_xfer_byte(NRF_CMD_TX);

     // send payload
     for(i = 0; i < payload->size; i++) {
          nrf_spi_xfer_byte(payload->data[i]);
     }
     nrf_spi_csh();

     // wait until payload passed TX FIFO
     do {
          nrf_read_reg(NRF_REG_STATUS, &status);

          // If MAX_RT is reached, indicate no bytes where sent ...
          if(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_MAX_RT, &status) == 1) {
               i = NRF_ERR_MAX_RT;
               break;
          }
     } while(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_TX_DS , &status) != 1);

     // clear TX_DS/MAX_RT bits (by writing 1 or just writing back the status)
     nrf_write_reg(NRF_REG_STATUS, &status);

     return i;
}


int nrf_receive(nrf_payload *payload)
{
     unsigned char i = 0;

     nrf_reg_buf status;

     nrf_read_reg(NRF_REG_STATUS, &status);

     // receive payload
     if(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_RX_DR, &status) == 1) {

          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_RX);

          for(i = 0; i < payload->size; i++) {
               payload->data[i] = nrf_spi_xfer_byte(NRF_CMD_RREG);
          }

          nrf_spi_csh();

          // write back status to clean RX_DR
          nrf_write_reg(NRF_REG_STATUS, &status);
     }

     nrf_read_reg(NRF_REG_FIFO_STATUS, &status);

     // if RX buffer is full, indicate no bytes where receifed, flush RX buffer
     if(nrf_get_reg_field(NRF_REG_FIFO_STATUS, NRF_REGF_FIFO_RX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_RX);
          nrf_spi_csh();
          return NRF_ERR_RX_FULL;
     }

     return i;
}

int nrf_receive_blocking(nrf_payload *payload)
{
     unsigned char i = 0;

     nrf_reg_buf status;

     // wait until data arrives
     do {
          nrf_read_reg(NRF_REG_STATUS, &status);
     } while(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_RX_DR, &status) != 1);

     // receive payload
     nrf_spi_csl();
     nrf_spi_xfer_byte(NRF_CMD_RX);

     for(i = 0; i < payload->size; i++) {
          payload->data[i] = nrf_spi_xfer_byte(NRF_CMD_RREG);
     }

     nrf_spi_csh();

     // write back status to clean RX_DR
     nrf_write_reg(NRF_REG_STATUS, &status);

     nrf_read_reg(NRF_REG_FIFO_STATUS, &status);

     // if RX buffer is full, indicate no bytes where receifed, flush RX buffer
     if(nrf_get_reg_field(NRF_REG_FIFO_STATUS, NRF_REGF_FIFO_RX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_RX);
          nrf_spi_csh();
          return NRF_ERR_RX_FULL;
     }

     return i;
}

int nrf_write_ack_pl(nrf_payload *payload, unsigned char pipe)
{
     int i;

     nrf_reg_buf status;
     nrf_read_reg(NRF_REG_STATUS, &status);

     // if TX buffer is full, indicate no bytes where sent, flush TX buffer
     if(nrf_get_reg_field(NRF_REG_STATUS, NRF_REGF_TX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_TX);
          nrf_spi_csh();
          return NRF_ERR_TX_FULL;
     }

     nrf_spi_csl();
     nrf_spi_xfer_byte(NRF_CMD_WACKPL | (0b00000111 & pipe));

     for(i = 0; i < payload->size; i++) {
          nrf_spi_xfer_byte(payload->data[i]);
     }

     nrf_spi_csh();

     return i;
}

int nrf_read_ack_pl(nrf_payload *payload)
{
     unsigned char i = 0;

     nrf_reg_buf status;
     nrf_read_reg(NRF_REG_FIFO_STATUS, &status);

     // if RX buffer is full, indicate no bytes where receifed, flush RX buffer
     if(nrf_get_reg_field(NRF_REG_FIFO_STATUS, NRF_REGF_FIFO_RX_FULL, &status) == 1) {
          nrf_spi_csl();
          nrf_spi_xfer_byte(NRF_CMD_FLUSH_RX);
          nrf_spi_csh();
          return NRF_ERR_RX_FULL;
     }

     nrf_spi_csl();
     nrf_spi_xfer_byte(NRF_CMD_RX);

     for(i = 0; i < payload->size; i++) {
          payload->data[i] = nrf_spi_xfer_byte(NRF_CMD_RREG);
     }

     nrf_spi_csh();

     return i;
}

void nrf_preset_sb(unsigned char mode, unsigned char rf_ch, unsigned char pw, nrf_reg_buf *addr)
{

     nrf_reg_buf buf;

