plantalog/cadi-gcl/stm32f407/current/wireless_nrf24/nrf24_lib.c
     // CONFIG - CRC enable, 2-Bit CRC, RX/TX mode
     nrf_read_reg(NRF_REG_CONFIG, &buf);
     nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_EN_CRC, &buf, 1);
     nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_CRCO, &buf, 1);
     nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_PRIM_RX, &buf, mode);
     nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_MASK_MAX_RT, &buf, 1);

     if(mode == NRF_MODE_PRX) {
          nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_MASK_TX_DS, &buf, 1);
     } else {
          nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_MASK_RX_DR, &buf, 1);
     }

     nrf_write_reg(NRF_REG_CONFIG, &buf);

     // Enable auto retry and delay
     nrf_read_reg(NRF_REG_SETUP_RETR, &buf);
     nrf_set_reg_field(NRF_REG_SETUP_RETR, NRF_REGF_ARC, &buf, retr);
     nrf_set_reg_field(NRF_REG_SETUP_RETR, NRF_REGF_ARD, &buf, delay);
     nrf_write_reg(NRF_REG_SETUP_RETR, &buf);

     // Set address width to 5 bytes
     nrf_read_reg(NRF_REG_SETUP_AW, &buf);
     nrf_set_reg_field(NRF_REG_SETUP_AW, NRF_REGF_AW, &buf, 0b11);
     nrf_write_reg(NRF_REG_SETUP_AW, &buf);

     // RX_ADDR_P0 - set receive address data pipe0
     nrf_write_reg(NRF_REG_RX_ADDR_P0, addr);

     // TX_ADDR - transmit address
     nrf_write_reg(NRF_REG_TX_ADDR, addr);

     // Set ACK PL + DYN PL
     nrf_read_reg(NRF_REG_FEATURE, &buf);
     nrf_set_reg_field(NRF_REG_FEATURE, NRF_REGF_EN_DPL, &buf, 1);
     nrf_set_reg_field(NRF_REG_FEATURE, NRF_REGF_EN_ACK_PAY, &buf, 1);
     nrf_write_reg(NRF_REG_FEATURE, &buf);

     // Enable dynamic payload width on PIPE0
     nrf_read_reg(NRF_REG_DYNPD, &buf);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P0, &buf, 1);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P1, &buf, 0);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P2, &buf, 0);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P3, &buf, 0);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P4, &buf, 0);
     nrf_set_reg_field(NRF_REG_DYNPD, NRF_REGF_DPL_P5, &buf, 0);
     nrf_write_reg(NRF_REG_DYNPD, &buf);

     if(mode == NRF_MODE_PRX) {
          // RX_PW_P0 - set number of bytes in RX payload in data PIPE0
          nrf_read_reg(NRF_REG_RX_PW_P0, &buf);
          nrf_set_reg_field(NRF_REG_RX_PW_P0, NRF_REGF_PW, &buf, pw);
          nrf_write_reg(NRF_REG_RX_PW_P0, &buf);
     }

     // Set RF-channel
     nrf_read_reg(NRF_REG_RF_CH, &buf);
     nrf_set_reg_field(NRF_REG_RF_CH, NRF_REGF_RF_CH, &buf, rf_ch);
     nrf_write_reg(NRF_REG_RF_CH, &buf);

     // Setup Data-Rate to 1MBit and RF power to 0db
     nrf_read_reg(NRF_REG_RF_SETUP, &buf);
     nrf_set_reg_field(NRF_REG_RF_SETUP, NRF_REGF_RF_DR , &buf, 0);
     nrf_set_reg_field(NRF_REG_RF_SETUP, NRF_REGF_RF_PWR, &buf, 3);
     nrf_write_reg(NRF_REG_RF_SETUP, &buf);

     // Power up radio
     nrf_read_reg(NRF_REG_CONFIG, &buf);
     nrf_set_reg_field(NRF_REG_CONFIG, NRF_REGF_PWR_UP, &buf, 1);
     nrf_write_reg(NRF_REG_CONFIG, &buf);
}

unsigned char nrf_spi_xfer_byte(unsigned char data)
{
	NRF24_SPIx->DR = data;
     //return spi_xfer(SPI2, data);
}

*/
